Found 31563 images belonging to 5 classes.
Found 3507 images belonging to 5 classes.
Found 3507 images belonging to 5 classes.
Model: "mobilenet_1.00_224"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 225, 225, 3)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 112, 112, 32)      864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 112, 112, 32)      128       
_________________________________________________________________
conv1_relu (ReLU)            (None, 112, 112, 32)      0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 112, 112, 32)      288       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 112, 112, 32)      128       
_________________________________________________________________
conv_dw_1_relu (ReLU)        (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 112, 112, 64)      2048      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 112, 112, 64)      256       
_________________________________________________________________
conv_pw_1_relu (ReLU)        (None, 112, 112, 64)      0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 113, 113, 64)      0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 56, 56, 64)        576       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 56, 56, 64)        256       
_________________________________________________________________
conv_dw_2_relu (ReLU)        (None, 56, 56, 64)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 56, 56, 128)       8192      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_2_relu (ReLU)        (None, 56, 56, 128)       0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 56, 56, 128)       1152      
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_dw_3_relu (ReLU)        (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 56, 56, 128)       16384     
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_3_relu (ReLU)        (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 57, 57, 128)       0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 28, 28, 128)       1152      
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 28, 28, 128)       512       
_________________________________________________________________
conv_dw_4_relu (ReLU)        (None, 28, 28, 128)       0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 28, 28, 256)       32768     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_4_relu (ReLU)        (None, 28, 28, 256)       0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 28, 28, 256)       2304      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_dw_5_relu (ReLU)        (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 28, 28, 256)       65536     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_5_relu (ReLU)        (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 29, 29, 256)       0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 14, 14, 256)       2304      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 14, 14, 256)       1024      
_________________________________________________________________
conv_dw_6_relu (ReLU)        (None, 14, 14, 256)       0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 14, 14, 512)       131072    
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_6_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_7_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_7_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_8_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_8_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_9_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_9_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_10_relu (ReLU)       (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_10_relu (ReLU)       (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_11_relu (ReLU)       (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_11_relu (ReLU)       (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 15, 15, 512)       0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 7, 7, 512)         4608      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 7, 7, 512)         2048      
_________________________________________________________________
conv_dw_12_relu (ReLU)       (None, 7, 7, 512)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 7, 7, 1024)        524288    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_12_relu (ReLU)       (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 7, 7, 1024)        9216      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_dw_13_relu (ReLU)       (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 7, 7, 1024)        1048576   
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_13_relu (ReLU)       (None, 7, 7, 1024)        0         
_________________________________________________________________
global_average_pooling2d_2 ( (None, 1024)              0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 1, 1, 1024)        0         
_________________________________________________________________
dropout (Dropout)            (None, 1, 1, 1024)        0         
_________________________________________________________________
conv_preds (Conv2D)          (None, 1, 1, 1000)        1025000   
_________________________________________________________________
reshape_2 (Reshape)          (None, 1000)              0         
_________________________________________________________________
act_softmax (Activation)     (None, 1000)              0         
=================================================================
Total params: 4,253,864
Trainable params: 4,231,976
Non-trainable params: 21,888
_________________________________________________________________
Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 225, 225, 3)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 112, 112, 32)      864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 112, 112, 32)      128       
_________________________________________________________________
conv1_relu (ReLU)            (None, 112, 112, 32)      0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 112, 112, 32)      288       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 112, 112, 32)      128       
_________________________________________________________________
conv_dw_1_relu (ReLU)        (None, 112, 112, 32)      0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 112, 112, 64)      2048      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 112, 112, 64)      256       
_________________________________________________________________
conv_pw_1_relu (ReLU)        (None, 112, 112, 64)      0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 113, 113, 64)      0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 56, 56, 64)        576       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 56, 56, 64)        256       
_________________________________________________________________
conv_dw_2_relu (ReLU)        (None, 56, 56, 64)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 56, 56, 128)       8192      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_2_relu (ReLU)        (None, 56, 56, 128)       0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 56, 56, 128)       1152      
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_dw_3_relu (ReLU)        (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 56, 56, 128)       16384     
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 56, 56, 128)       512       
_________________________________________________________________
conv_pw_3_relu (ReLU)        (None, 56, 56, 128)       0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 57, 57, 128)       0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 28, 28, 128)       1152      
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 28, 28, 128)       512       
_________________________________________________________________
conv_dw_4_relu (ReLU)        (None, 28, 28, 128)       0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 28, 28, 256)       32768     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_4_relu (ReLU)        (None, 28, 28, 256)       0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 28, 28, 256)       2304      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_dw_5_relu (ReLU)        (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 28, 28, 256)       65536     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 28, 28, 256)       1024      
_________________________________________________________________
conv_pw_5_relu (ReLU)        (None, 28, 28, 256)       0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 29, 29, 256)       0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 14, 14, 256)       2304      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 14, 14, 256)       1024      
_________________________________________________________________
conv_dw_6_relu (ReLU)        (None, 14, 14, 256)       0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 14, 14, 512)       131072    
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_6_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_7_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_7_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_8_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_8_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_9_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_9_relu (ReLU)        (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_10_relu (ReLU)       (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_10_relu (ReLU)       (None, 14, 14, 512)       0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 14, 14, 512)       4608      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_dw_11_relu (ReLU)       (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 14, 14, 512)       262144    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 14, 14, 512)       2048      
_________________________________________________________________
conv_pw_11_relu (ReLU)       (None, 14, 14, 512)       0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 15, 15, 512)       0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 7, 7, 512)         4608      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 7, 7, 512)         2048      
_________________________________________________________________
conv_dw_12_relu (ReLU)       (None, 7, 7, 512)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 7, 7, 1024)        524288    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_12_relu (ReLU)       (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 7, 7, 1024)        9216      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_dw_13_relu (ReLU)       (None, 7, 7, 1024)        0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 7, 7, 1024)        1048576   
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 7, 7, 1024)        4096      
_________________________________________________________________
conv_pw_13_relu (ReLU)       (None, 7, 7, 1024)        0         
_________________________________________________________________
global_average_pooling2d_2 ( (None, 1024)              0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 5)                 5125      
=================================================================
Total params: 3,233,989
Trainable params: 3,212,101
Non-trainable params: 21,888
_________________________________________________________________
Epoch 1/30
3157/3157 [==============================] - 507s 161ms/step - loss: 5.9952 - categorical_accuracy: 0.3006 - top_2_accuracy: 0.6085 - top_3_accuracy: 0.8111 - val_loss: 2.7340 - val_categorical_accuracy: 0.7154 - val_top_2_accuracy: 0.8152 - val_top_3_accuracy: 0.9569

Epoch 00001: val_top_3_accuracy improved from -inf to 0.95694, saving model to model.h5
Epoch 2/30
3157/3157 [==============================] - 461s 146ms/step - loss: 5.5141 - categorical_accuracy: 0.3144 - top_2_accuracy: 0.6261 - top_3_accuracy: 0.8241 - val_loss: 1.9733 - val_categorical_accuracy: 0.0830 - val_top_2_accuracy: 0.8004 - val_top_3_accuracy: 0.9521

Epoch 00002: val_top_3_accuracy did not improve from 0.95694
Epoch 3/30
3157/3157 [==============================] - 460s 146ms/step - loss: 5.1615 - categorical_accuracy: 0.3394 - top_2_accuracy: 0.6554 - top_3_accuracy: 0.8482 - val_loss: 0.7092 - val_categorical_accuracy: 0.7211 - val_top_2_accuracy: 0.8192 - val_top_3_accuracy: 0.9638

Epoch 00003: val_top_3_accuracy improved from 0.95694 to 0.96379, saving model to model.h5
Epoch 4/30
3157/3157 [==============================] - 461s 146ms/step - loss: 4.7603 - categorical_accuracy: 0.3489 - top_2_accuracy: 0.6727 - top_3_accuracy: 0.8564 - val_loss: 0.7576 - val_categorical_accuracy: 0.7160 - val_top_2_accuracy: 0.8124 - val_top_3_accuracy: 0.9564

Epoch 00004: val_top_3_accuracy did not improve from 0.96379
Epoch 5/30
3157/3157 [==============================] - 461s 146ms/step - loss: 4.6087 - categorical_accuracy: 0.3583 - top_2_accuracy: 0.6853 - top_3_accuracy: 0.8643 - val_loss: 1.0325 - val_categorical_accuracy: 0.7388 - val_top_2_accuracy: 0.8395 - val_top_3_accuracy: 0.9646

Epoch 00005: val_top_3_accuracy improved from 0.96379 to 0.96464, saving model to model.h5
Epoch 6/30
3157/3157 [==============================] - 463s 147ms/step - loss: 4.4710 - categorical_accuracy: 0.3597 - top_2_accuracy: 0.6902 - top_3_accuracy: 0.8712 - val_loss: 1.5131 - val_categorical_accuracy: 0.1257 - val_top_2_accuracy: 0.7958 - val_top_3_accuracy: 0.9501

Epoch 00006: val_top_3_accuracy did not improve from 0.96464
Epoch 7/30
3157/3157 [==============================] - 467s 148ms/step - loss: 4.4261 - categorical_accuracy: 0.3691 - top_2_accuracy: 0.7026 - top_3_accuracy: 0.8764 - val_loss: 1.3257 - val_categorical_accuracy: 0.7365 - val_top_2_accuracy: 0.8121 - val_top_3_accuracy: 0.9604

Epoch 00007: val_top_3_accuracy did not improve from 0.96464

Epoch 00007: ReduceLROnPlateau reducing learning rate to 0.004999999888241291.
Epoch 8/30
3157/3157 [==============================] - 460s 146ms/step - loss: 4.0649 - categorical_accuracy: 0.3786 - top_2_accuracy: 0.7290 - top_3_accuracy: 0.8956 - val_loss: 0.3584 - val_categorical_accuracy: 0.7314 - val_top_2_accuracy: 0.8164 - val_top_3_accuracy: 0.9589

Epoch 00008: val_top_3_accuracy did not improve from 0.96464
Epoch 9/30
3157/3157 [==============================] - 460s 146ms/step - loss: 3.9198 - categorical_accuracy: 0.3883 - top_2_accuracy: 0.7414 - top_3_accuracy: 0.9078 - val_loss: 1.1756 - val_categorical_accuracy: 0.4098 - val_top_2_accuracy: 0.8118 - val_top_3_accuracy: 0.9607

Epoch 00009: val_top_3_accuracy did not improve from 0.96464

Epoch 00009: ReduceLROnPlateau reducing learning rate to 0.0024999999441206455.
Epoch 10/30
3157/3157 [==============================] - 460s 146ms/step - loss: 3.6369 - categorical_accuracy: 0.4033 - top_2_accuracy: 0.7636 - top_3_accuracy: 0.9266 - val_loss: 1.5090 - val_categorical_accuracy: 0.6918 - val_top_2_accuracy: 0.8138 - val_top_3_accuracy: 0.9581

Epoch 00010: val_top_3_accuracy did not improve from 0.96464
Epoch 11/30
3157/3157 [==============================] - 460s 146ms/step - loss: 3.4370 - categorical_accuracy: 0.3938 - top_2_accuracy: 0.7806 - top_3_accuracy: 0.9395 - val_loss: 1.9981 - val_categorical_accuracy: 0.1891 - val_top_2_accuracy: 0.8081 - val_top_3_accuracy: 0.9581

Epoch 00011: val_top_3_accuracy did not improve from 0.96464

Epoch 00011: ReduceLROnPlateau reducing learning rate to 0.0012499999720603228.
Epoch 12/30
3157/3157 [==============================] - 459s 145ms/step - loss: 3.2535 - categorical_accuracy: 0.4048 - top_2_accuracy: 0.7955 - top_3_accuracy: 0.9484 - val_loss: 0.5436 - val_categorical_accuracy: 0.6156 - val_top_2_accuracy: 0.8144 - val_top_3_accuracy: 0.9587

Epoch 00012: val_top_3_accuracy did not improve from 0.96464
Epoch 13/30
3157/3157 [==============================] - 460s 146ms/step - loss: 3.1473 - categorical_accuracy: 0.4167 - top_2_accuracy: 0.7979 - top_3_accuracy: 0.9521 - val_loss: 0.7672 - val_categorical_accuracy: 0.7265 - val_top_2_accuracy: 0.8224 - val_top_3_accuracy: 0.9618

Epoch 00013: val_top_3_accuracy did not improve from 0.96464

Epoch 00013: ReduceLROnPlateau reducing learning rate to 0.0006249999860301614.
Epoch 14/30
3157/3157 [==============================] - 463s 147ms/step - loss: 3.0004 - categorical_accuracy: 0.4272 - top_2_accuracy: 0.8061 - top_3_accuracy: 0.9572 - val_loss: 2.2705 - val_categorical_accuracy: 0.7291 - val_top_2_accuracy: 0.8212 - val_top_3_accuracy: 0.9609

Epoch 00014: val_top_3_accuracy did not improve from 0.96464
Epoch 15/30
3157/3157 [==============================] - 462s 146ms/step - loss: 2.9697 - categorical_accuracy: 0.4304 - top_2_accuracy: 0.8117 - top_3_accuracy: 0.9631 - val_loss: 0.4617 - val_categorical_accuracy: 0.7183 - val_top_2_accuracy: 0.8244 - val_top_3_accuracy: 0.9624

Epoch 00015: val_top_3_accuracy did not improve from 0.96464

Epoch 00015: ReduceLROnPlateau reducing learning rate to 0.0003124999930150807.
Epoch 16/30
3157/3157 [==============================] - 465s 147ms/step - loss: 2.8644 - categorical_accuracy: 0.4344 - top_2_accuracy: 0.8200 - top_3_accuracy: 0.9669 - val_loss: 0.4152 - val_categorical_accuracy: 0.6755 - val_top_2_accuracy: 0.8206 - val_top_3_accuracy: 0.9612

Epoch 00016: val_top_3_accuracy did not improve from 0.96464
Epoch 17/30
3157/3157 [==============================] - 460s 146ms/step - loss: 2.8309 - categorical_accuracy: 0.4339 - top_2_accuracy: 0.8251 - top_3_accuracy: 0.9680 - val_loss: 0.6316 - val_categorical_accuracy: 0.7046 - val_top_2_accuracy: 0.8218 - val_top_3_accuracy: 0.9612

Epoch 00017: val_top_3_accuracy did not improve from 0.96464

Epoch 00017: ReduceLROnPlateau reducing learning rate to 0.00015624999650754035.
Epoch 18/30
3157/3157 [==============================] - 462s 146ms/step - loss: 2.8105 - categorical_accuracy: 0.4369 - top_2_accuracy: 0.8245 - top_3_accuracy: 0.9668 - val_loss: 0.3262 - val_categorical_accuracy: 0.6958 - val_top_2_accuracy: 0.8218 - val_top_3_accuracy: 0.9612

Epoch 00018: val_top_3_accuracy did not improve from 0.96464
Epoch 19/30
3157/3157 [==============================] - 464s 147ms/step - loss: 2.7972 - categorical_accuracy: 0.4328 - top_2_accuracy: 0.8237 - top_3_accuracy: 0.9676 - val_loss: 0.6936 - val_categorical_accuracy: 0.7120 - val_top_2_accuracy: 0.8238 - val_top_3_accuracy: 0.9612

Epoch 00019: val_top_3_accuracy did not improve from 0.96464

Epoch 00019: ReduceLROnPlateau reducing learning rate to 7.812499825377017e-05.
Epoch 20/30
3157/3157 [==============================] - 464s 147ms/step - loss: 2.7860 - categorical_accuracy: 0.4390 - top_2_accuracy: 0.8287 - top_3_accuracy: 0.9702 - val_loss: 1.5619 - val_categorical_accuracy: 0.7123 - val_top_2_accuracy: 0.8226 - val_top_3_accuracy: 0.9618

Epoch 00020: val_top_3_accuracy did not improve from 0.96464
Epoch 21/30
3157/3157 [==============================] - 461s 146ms/step - loss: 2.7924 - categorical_accuracy: 0.4430 - top_2_accuracy: 0.8308 - top_3_accuracy: 0.9719 - val_loss: 0.4823 - val_categorical_accuracy: 0.7046 - val_top_2_accuracy: 0.8226 - val_top_3_accuracy: 0.9615

Epoch 00021: val_top_3_accuracy did not improve from 0.96464

Epoch 00021: ReduceLROnPlateau reducing learning rate to 3.9062499126885086e-05.
Epoch 22/30
3157/3157 [==============================] - 461s 146ms/step - loss: 2.7672 - categorical_accuracy: 0.4348 - top_2_accuracy: 0.8275 - top_3_accuracy: 0.9693 - val_loss: 1.1162 - val_categorical_accuracy: 0.7171 - val_top_2_accuracy: 0.8235 - val_top_3_accuracy: 0.9615

Epoch 00022: val_top_3_accuracy did not improve from 0.96464
Epoch 23/30
3157/3157 [==============================] - 461s 146ms/step - loss: 2.8204 - categorical_accuracy: 0.4458 - top_2_accuracy: 0.8291 - top_3_accuracy: 0.9695 - val_loss: 0.9458 - val_categorical_accuracy: 0.7086 - val_top_2_accuracy: 0.8235 - val_top_3_accuracy: 0.9612

Epoch 00023: val_top_3_accuracy did not improve from 0.96464

Epoch 00023: ReduceLROnPlateau reducing learning rate to 1.9531249563442543e-05.
Epoch 24/30
3157/3157 [==============================] - 461s 146ms/step - loss: 2.7688 - categorical_accuracy: 0.4460 - top_2_accuracy: 0.8287 - top_3_accuracy: 0.9691 - val_loss: 0.5224 - val_categorical_accuracy: 0.7094 - val_top_2_accuracy: 0.8226 - val_top_3_accuracy: 0.9618

Epoch 00024: val_top_3_accuracy did not improve from 0.96464
Epoch 25/30
3157/3157 [==============================] - 463s 147ms/step - loss: 2.7740 - categorical_accuracy: 0.4401 - top_2_accuracy: 0.8274 - top_3_accuracy: 0.9692 - val_loss: 2.8974 - val_categorical_accuracy: 0.7114 - val_top_2_accuracy: 0.8226 - val_top_3_accuracy: 0.9615

Epoch 00025: val_top_3_accuracy did not improve from 0.96464

Epoch 00025: ReduceLROnPlateau reducing learning rate to 1e-05.
Epoch 26/30
3157/3157 [==============================] - 464s 147ms/step - loss: 2.7650 - categorical_accuracy: 0.4467 - top_2_accuracy: 0.8304 - top_3_accuracy: 0.9710 - val_loss: 0.7672 - val_categorical_accuracy: 0.7080 - val_top_2_accuracy: 0.8226 - val_top_3_accuracy: 0.9615

Epoch 00026: val_top_3_accuracy did not improve from 0.96464
Epoch 27/30
3157/3157 [==============================] - 463s 147ms/step - loss: 2.7517 - categorical_accuracy: 0.4517 - top_2_accuracy: 0.8316 - top_3_accuracy: 0.9710 - val_loss: 0.8639 - val_categorical_accuracy: 0.7123 - val_top_2_accuracy: 0.8221 - val_top_3_accuracy: 0.9618

Epoch 00027: val_top_3_accuracy did not improve from 0.96464
Epoch 28/30
3157/3157 [==============================] - 466s 148ms/step - loss: 2.7830 - categorical_accuracy: 0.4519 - top_2_accuracy: 0.8291 - top_3_accuracy: 0.9710 - val_loss: 0.5051 - val_categorical_accuracy: 0.7111 - val_top_2_accuracy: 0.8226 - val_top_3_accuracy: 0.9618

Epoch 00028: val_top_3_accuracy did not improve from 0.96464
Epoch 29/30
3157/3157 [==============================] - 468s 148ms/step - loss: 2.7698 - categorical_accuracy: 0.4417 - top_2_accuracy: 0.8301 - top_3_accuracy: 0.9698 - val_loss: 0.8489 - val_categorical_accuracy: 0.7114 - val_top_2_accuracy: 0.8232 - val_top_3_accuracy: 0.9618

Epoch 00029: val_top_3_accuracy did not improve from 0.96464
Epoch 30/30
3157/3157 [==============================] - 473s 150ms/step - loss: 2.7645 - categorical_accuracy: 0.4519 - top_2_accuracy: 0.8309 - top_3_accuracy: 0.9710 - val_loss: 0.7778 - val_categorical_accuracy: 0.7106 - val_top_2_accuracy: 0.8232 - val_top_3_accuracy: 0.9612

Epoch 00030: val_top_3_accuracy did not improve from 0.96464
val_loss: 4.326600551605225
val_cat_acc: 0.7105788588523865
val_top_2_acc: 0.8232107162475586
val_top_3_acc: 0.9612204432487488
val_loss: 3.3637242317199707
val_cat_acc: 0.7388080954551697
val_top_2_acc: 0.8394639492034912
val_top_3_acc: 0.9646421670913696
351/351 [==============================] - 47s 135ms/step
Confusion matrix, without normalization
[[1474 1081    8    5   10]
 [ 153   89    0    0    1]
 [ 276  222   20    6    5]
 [  43   29    7    8    0]
 [  24   15   10    5   16]]
